Revit 2026 API

# CurveElementFilter Class

---

A filter used to pass curve elements which are of a specific type.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBCurveElementFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveElementFilter : ElementSlowFilter
```
```vb
Public Class CurveElementFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class CurveElementFilter : public ElementSlowFilter
```
```fsharp
type CurveElementFilter =
    class
        inherit ElementSlowFilter
    end
```

The CurveElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementFilter(CurveElementType) | Constructs a new instance of a filter to match specific types of curve elements. |
|  | CurveElementFilter(CurveElementType, Boolean) | Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type. |

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementType | The curve element type. |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace